#include <stdio.h>
#define NUMBER 90 //定义人数上限
int main()
{
    int i, j, a[NUMBER], dis[11] = { 0 }, b;
    //ij计数 a成绩数组 dis成绩分布数组 b实际人数

    printf("请输入学生人数：");
    scanf("%d", &b);

        
    for (i = 0; i < b; i++)
    {
        printf("%2d号：", i + 1);
        do
        {
            scanf("%d", &a[i]);
            if (a[i] < 0 || a[i]>100)
                printf("请输入0-100之间的数：");
        } while (a[i] < 0 || a[i]>100);

        dis[a[i] / 10]++; 
    }
    //-----------------------------------输出星星的行数=人数最多的那一列的人数 将最多人数的分数段的人数赋给max（准备工作）
    int max = dis[0];
    for (i = 1; i < 11; i++)
    {
        if (dis[i] > max)
            max = dis[i];
    }
    //-----------------------------------输出星星
    for (; max > 0; max--)//有max行 外循环max次
    {
        for (j = 0; j < 11; j++)//有11列 循环11次 
 //  本次循环完毕表示一行输出完毕 需要换行进行下一行输出
 //----------------------------------- 当某分数段人数大于等于max时，内循环输出星星直到内循环结束。每次外循环max--  
 //  比如 最多人数的分数段（max）=3 则人数为3的分数段（通过内循环）各自输出星星 内循环结束 回车
 //  第二次外循环（max=2）则人数为3和2的分数段（通过内循环）输出星星 内循环结束 回车
 //  第三次外循环（max=1）则人数为3和2和1的分数段（通过内循环）输出星星 回车 外循环结束
        {
            if (dis[j] >= max)
                printf("   *");
            else
                printf("    ");
        }
        putchar('\n');
    }
    putchar('\n');
    //-----------------------------------输出底部线条
    for (i = 0; i < 45; i++)
    {
        printf("-");
    }
    putchar('\n');
    //-----------------------------------输出底部数字
    for (i = 0; i < 11; i++)
    {
        printf("%4d", i * 10);
    }
    putchar('\n');
    return 0;
}
